/******************************************************************************
  *  文件名     : epoll_timer.h
  *  负责人     : xupeng
  *  创建日期   : 20250126
  *  版本号     : v1.1 
  *  文件描述   : 基于EPOLL实现的C语言定时器.
  *  其他       : 无.
  *  修改日志   : 无.
******************************************************************************/
#ifndef __EPOLL_TIMER_H__
#define __EPOLL_TIMER_H__

#ifdef __cplusplus
extern "C" {
#endif

#define EPOLL_EVENT_SIZE 8

typedef struct TIMER_CTX_S
{
    int timerfd;
    void *data;     /* alloc and free by caller */
} TIMER_CTX_T;

typedef int (*TIMER_HANDLER)(TIMER_CTX_T *ctx);

typedef struct EPOLL_TIMER_S
{
    TIMER_CTX_T ctx;
    TIMER_HANDLER handler;
} EPOLL_TIMER_T;

/************************************************************************* 
*  负责人    : xupeng
*  创建日期  : 20250127
*  函数功能  : 创建 EPOLL 文件描述符.
*  输入参数  : 无.
*  输出参数  : 无.
*  返回值    : EPOLL 文件描述符.
*************************************************************************/
int create_epollfd(void);

/************************************************************************* 
*  负责人    : xupeng
*  创建日期  : 20250127
*  函数功能  : 创建毫秒级EPOLL定时器.
*  输入参数  : timer - 定时器回调参数.
*             epollfd - EPOLL 文件描述符.
*             interval - 定时器回调间隔(毫秒).
*  输出参数  : 无.
*  返回值    : 0 - 成功  -1 - 失败.
*************************************************************************/
int create_ms_epoll_timer(EPOLL_TIMER_T *timer, int epollfd, int interval);

/************************************************************************* 
*  负责人    : xupeng
*  创建日期  : 20250127
*  函数功能  : 销毁毫秒级EPOLL定时器.
*  输入参数  : timer - 定时器回调参数.
*             epollfd - EPOLL 文件描述符.
*  输出参数  : 无.
*  返回值    : 无.
*************************************************************************/
void destroy_ms_epoll_timer(EPOLL_TIMER_T *timer, int epollfd);

/************************************************************************* 
*  负责人    : xupeng
*  创建日期  : 20250127
*  函数功能  : 非阻塞EPOLL定时器维护循环(默认开启循环).
*  输入参数  : para - EPOLL 文件描述符.
*  输出参数  : 无.
*  返回值    : 无.
*************************************************************************/
void *nonblock_epoll_timer_loop_run(void *para);

/************************************************************************* 
*  负责人    : xupeng
*  创建日期  : 20250127
*  函数功能  : 开启非阻塞EPOLL定时器维护循环.
*  输入参数  : 无.
*  输出参数  : 无.
*  返回值    : 无.
*************************************************************************/
void nonblock_epoll_timer_loop_start(void);

/************************************************************************* 
*  负责人    : xupeng
*  创建日期  : 20250127
*  函数功能  : 终止非阻塞EPOLL定时器维护循环.
*  输入参数  : 无.
*  输出参数  : 无.
*  返回值    : 无.
*************************************************************************/
void nonblock_epoll_timer_loop_stop(void);

#ifdef __cplusplus
}
#endif

#endif
